#ifndef REMOTE_CONTROL_H_
#define REMOTE_CONTROL_H_

#include "zf_device_uart_receiver.h"

// 遥控器通道数量，当前使用 SBUS 接收链路总通道数
#define REMOTE_CONTROL_CHANNEL_NUM       (UART_RECEVIER_CHANNEL_NUM)

// CH1：右摇杆左右   中位约 992（采用）
// CH2：右摇杆上下   中位约 992
// CH3：左摇杆上下   中位约 992（采用）
// CH4：左摇杆左右   中位约 940（轻微飘）
// CH5：左 1 号开关  上 192 / 中 992 / 下 1792
// CH6：左 2 号开关  上 192 / 下 1792（采用）
// CH7：右 2 号开关  上 192 / 下 1792（采用）
// CH8：右 1 号开关  上 192 / 中 992 / 下 1792
// CH9： 左旋钮       192 ~ 1792
// CH10：右旋钮       192 ~ 1792

// 当前遥控通道定义
#define REMOTE_CONTROL_LEFT_RIGHT_CH      (0)     // 通道 1：右摇杆左右方向
#define REMOTE_CONTROL_FRONT_REAR_CH      (2)     // 通道 3：左摇杆前后方向
#define REMOTE_CONTROL_RIGHT_01_SWITCH_CH (7)     // 通道 8：右侧 1 号开关
#define REMOTE_CONTROL_RIGHT_02_SWITCH_CH (6)     // 通道 7：右侧 2 号开关
#define REMOTE_CONTROL_LEFT_01_SWITCH_CH  (4)     // 通道 5：左侧 1 号开关
#define REMOTE_CONTROL_LEFT_02_SWITCH_CH  (5)     // 通道 6：左侧 2 号开关

// 当前控制信号原始值定义
#define REMOTE_CONTROL_CENTER_RAW         (992)   // 中位值

//-------------------------------------------------------------------------------------------------------------------
// 函数名称     remote_control_init
// 参数说明     void
// 返回值       void
// 使用说明     remote_control_init();
// 说明         这里会初始化 UART 接收器，并初始化 SBUS 接收链路
//-------------------------------------------------------------------------------------------------------------------
void remote_control_init(void);

//-------------------------------------------------------------------------------------------------------------------
// 函数名称     remote_update
// 参数说明     void
// 返回值       void
// 使用说明     remote_update();
// 说明         定时更新遥控器数据缓存
//              如果接收到数据，则更新 uart_receiver.channel[]
//              如果没有接收到新数据，则保持上一帧遥控值不变
//-------------------------------------------------------------------------------------------------------------------
void remote_update(void);

//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// 函数名称     remote_get_channel
// 功能说明     获取指定遥控通道原始值
// 参数说明     ch              通道索引，范围 0 ~ REMOTE_CONTROL_CHANNEL_NUM - 1
// 返回值       uint16          通道原始值，正常范围大于 0
// 使用说明     uint16 ch1 = remote_get_channel(REMOTE_CONTROL_LEFT_RIGHT_CH);
//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
uint16 remote_get_channel(uint8 ch);

//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// 函数名称     remote_is_online
// 功能说明     获取遥控器是否在线
// 参数说明     void
// 返回值       uint8           1：遥控器在线  0：接收链路掉线或信号丢失
// 使用说明     if(remote_is_online()) { }
// 说明         通过 uart_receiver.state 判断接收器状态，通常 remote_update() 调用前先检查
//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
uint8 remote_is_online(void);

//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// 函数名称     remote_front_rear_ctrl
// 功能说明     前后通道遥控量计算
// 返回值       int16           根据前后通道遥控量计算得到的控制值
// 使用说明     int16 speed = remote_front_rear_ctrl();
// 说明         内部固定使用 base = 0、max = 1000、min = -1000、dead_zone = 30
//              当遥控信号接近 REMOTE_CONTROL_CENTER_RAW 且在 dead_zone 内时，输出将被视为 0
//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
int16 remote_front_rear_ctrl(void);

//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// 函数名称     remote_left_right_ctrl
// 功能说明     左/右通道遥控量计算
// 返回值       int16           根据左/右通道遥控量计算得到的控制值
// 使用说明     int16 turn = remote_left_right_ctrl();
// 说明         内部固定使用 base = 0、max = 1000、min = -1000、dead_zone = 30
//              当遥控信号接近 REMOTE_CONTROL_CENTER_RAW 且在 dead_zone 内时，输出将被视为 0
//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
int16 remote_left_right_ctrl(void);

//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// 函数名称     remote_left_01_switch_ctrl
// 功能说明     左侧 1 号开关状态判断
// 参数说明     void
// 返回值       uint8            小于200返回 1，200-1500范围返回 0，其余范围返回 2
// 使用说明     uint8 switch_state = remote_left_01_switch_ctrl();
// 说明         小于200返回 1，200-1500范围返回 0，其余范围返回 2
//主要用于控制惯导标志位，0为初始状态，正常记录惯导数据，0->1为写入flash，0->2为读取flash
//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void remote_left_01_switch_ctrl(void);

//-------------------------------------------------------------------------------------------------------------------
// 函数名称     remote_left_02_switch_ctrl
// 功能说明     左侧 2 号开关状态判断
// 参数说明     void
// 返回值       int8            1000 范围返回 1，1500 或 2000 范围返回 0
// 使用说明     int8 switch_state = remote_left_02_switch_ctrl();
// 说明         使用 REMOTE_CONTROL_SWITCH_LOW_RAW 作为下限，1 表示低档，0 表示高档   （暂未使用，目前打算用于控制路径回放标志位，0->1档用于控制记录惯导数据，0-> 2档用于回放，3档用于初始态）
//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void remote_left_02_switch_ctrl(void);

//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// 函数名称     remote_right_01_switch_ctrl
// 功能说明     右侧 1 号开关状态判断
// 参数说明     void
// 返回值       void
// 使用说明     remote_right_01_switch_ctrl();
// 说明         目前仅读取右侧 1 号开关通道原始值，后续可在此接入具体控制逻辑
//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void remote_right_01_switch_ctrl(void);

//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// 函数名称     remote_right_02_switch_ctrl
// 功能说明     右侧 2 号开关状态判断
// 参数说明     void
// 返回值       void
// 使用说明     remote_right_02_switch_ctrl();
// 说明         目前仅读取右侧 2 号开关通道原始值，后续可在此接入具体控制逻辑
//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void remote_right_02_switch_ctrl(void);

#endif
